# Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать.

#mylist["k", "e", "l", "d", "6", "p", "90",]
#print(" ".join(mylist))

#option1
#mylist["k", "e", "l", "d", "6", "p", "9",]
#mylist = mylist[::-1]
#print("".join(mylist)) 


#option2
mylist = ['y', 'r', 'o', 't', 'o', 'r',]
print(''.join(mylist)[::-1])
